Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM7_rcc.h
/*
 * SPDX-License-Identifier: MIT
 * SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
 *
 * Generated using the .svd description
 * Goal:     stm32H747_CM7_rcc equates.
 */

#pragma once

#include    <stdint.h>

// RCC address definitions
// -----------------------

typedef struct {
    volatile    uint32_t    CR;
    volatile    uint32_t    HSICFGR;
    volatile    uint32_t    CRRCR;
    volatile    uint32_t    RESERVED0;
    volatile    uint32_t    CFGR;
    volatile    uint32_t    RESERVED1;
    volatile    uint32_t    D1CFGR;
    volatile    uint32_t    D2CFGR;
    volatile    uint32_t    D3CFGR;
    volatile    uint32_t    RESERVED2;
    volatile    uint32_t    PLLCKSELR;
    volatile    uint32_t    PLLCFGR;
    volatile    uint32_t    PLL1DIVR;
    volatile    uint32_t    PLL1FRACR;
    volatile    uint32_t    PLL2DIVR;
    volatile    uint32_t    PLL2FRACR;
    volatile    uint32_t    PLL3DIVR;
    volatile    uint32_t    PLL3FRACR;
    volatile    uint32_t    RESERVED3;
    volatile    uint32_t    D1CCIPR;
    volatile    uint32_t    D2CCIP1R;
    volatile    uint32_t    D2CCIP2R;
    volatile    uint32_t    D3CCIPR;
    volatile    uint32_t    RESERVED4;
    volatile    uint32_t    CIER;
    volatile    uint32_t    CIFR;
    volatile    uint32_t    CICR;
    volatile    uint32_t    RESERVED5;
    volatile    uint32_t    BDCR;
    volatile    uint32_t    CSR;
    volatile    uint32_t    RESERVED6;
    volatile    uint32_t    AHB3RSTR;
    volatile    uint32_t    AHB1RSTR;
    volatile    uint32_t    AHB2RSTR;
    volatile    uint32_t    AHB4RSTR;
    volatile    uint32_t    APB3RSTR;
    volatile    uint32_t    APB1LRSTR;
    volatile    uint32_t    APB1HRSTR;
    volatile    uint32_t    APB2RSTR;
    volatile    uint32_t    APB4RSTR;
    volatile    uint32_t    GCR;
    volatile    uint32_t    RESERVED7;
    volatile    uint32_t    D3AMR;
    volatile    uint32_t    RESERVED8[9];
    volatile    uint32_t    RSR;
    volatile    uint32_t    AHB3ENR;
    volatile    uint32_t    AHB1ENR;
    volatile    uint32_t    AHB2ENR;
    volatile    uint32_t    AHB4ENR;
    volatile    uint32_t    APB3ENR;
    volatile    uint32_t    APB1LENR;
    volatile    uint32_t    APB1HENR;
    volatile    uint32_t    APB2ENR;
    volatile    uint32_t    APB4ENR;
    volatile    uint32_t    RESERVED9;
    volatile    uint32_t    AHB3LPENR;
    volatile    uint32_t    AHB1LPENR;
    volatile    uint32_t    AHB2LPENR;
    volatile    uint32_t    AHB4LPENR;
    volatile    uint32_t    APB3LPENR;
    volatile    uint32_t    APB1LLPENR;
    volatile    uint32_t    APB1HLPENR;
    volatile    uint32_t    APB2LPENR;
    volatile    uint32_t    APB4LPENR;
    volatile    uint32_t    RESERVED10[4];
    volatile    uint32_t    C1_RSR;
    volatile    uint32_t    C1_AHB3ENR;
    volatile    uint32_t    C1_AHB1ENR;
    volatile    uint32_t    C1_AHB2ENR;
    volatile    uint32_t    C1_AHB4ENR;
    volatile    uint32_t    C1_APB3ENR;
    volatile    uint32_t    C1_APB1LENR;
    volatile    uint32_t    C1_APB1HENR;
    volatile    uint32_t    C1_APB2ENR;
    volatile    uint32_t    C1_APB4ENR;
    volatile    uint32_t    RESERVED11;
    volatile    uint32_t    C1_AHB3LPENR;
    volatile    uint32_t    C1_AHB1LPENR;
    volatile    uint32_t    C1_AHB2LPENR;
    volatile    uint32_t    C1_AHB4LPENR;
    volatile    uint32_t    C1_APB3LPENR;
    volatile    uint32_t    C1_APB1LLPENR;
    volatile    uint32_t    C1_APB1HLPENR;
    volatile    uint32_t    C1_APB2LPENR;
    volatile    uint32_t    C1_APB4LPENR;
} RCC_TypeDef;

#ifdef __cplusplus
#define RCC reinterpret_cast<RCC_TypeDef *>(0x58024400U)

#else
#define RCC ((RCC_TypeDef *)0x58024400U)
#endif

// CR Configuration

#define RCC_CR_PLL3RDY                      (0x1U<<29U)
#define RCC_CR_PLL3ON                       (0x1U<<28U)
#define RCC_CR_PLL2RDY                      (0x1U<<27U)
#define RCC_CR_PLL2ON                       (0x1U<<26U)
#define RCC_CR_PLL1RDY                      (0x1U<<25U)
#define RCC_CR_PLL1ON                       (0x1U<<24U)
#define RCC_CR_HSECSSON                     (0x1U<<19U)
#define RCC_CR_HSEBYP                       (0x1U<<18U)
#define RCC_CR_HSERDY                       (0x1U<<17U)
#define RCC_CR_HSEON                        (0x1U<<16U)
#define RCC_CR_D2CKRDY                      (0x1U<<15U)
#define RCC_CR_D1CKRDY                      (0x1U<<14U)
#define RCC_CR_RC48RDY                      (0x1U<<13U)
#define RCC_CR_RC48ON                       (0x1U<<12U)
#define RCC_CR_CSIKERON                     (0x1U<<9U)
#define RCC_CR_CSIRDY                       (0x1U<<8U)
#define RCC_CR_CSION                        (0x1U<<7U)
#define RCC_CR_HSIDIVF                      (0x1U<<5U)
#define RCC_CR_HSIDIV                       (0x3U<<3U)
#define RCC_CR_HSIDIV_0                     (0x1U<<3U)
#define RCC_CR_HSIRDY                       (0x1U<<2U)
#define RCC_CR_HSIKERON                     (0x1U<<1U)
#define RCC_CR_HSION                        (0x1U<<0U)

// HSICFGR Configuration

#define RCC_HSICFGR_HSITRIM                 (0x7FU<<24U)
#define RCC_HSICFGR_HSITRIM_0               (0x1U<<24U)
#define RCC_HSICFGR_HSICAL                  (0xFFFU<<0U)
#define RCC_HSICFGR_HSICAL_0                (0x1U<<0U)

// CRRCR Configuration

#define RCC_CRRCR_RC48CAL                   (0x3FFU<<0U)
#define RCC_CRRCR_RC48CAL_0                 (0x1U<<0U)

// CFGR Configuration

#define RCC_CFGR_MCO2SEL                    (0x7U<<29U)
#define RCC_CFGR_MCO2SEL_0                  (0x1U<<29U)
#define RCC_CFGR_MCO2PRE                    (0xFU<<25U)
#define RCC_CFGR_MCO2PRE_0                  (0x1U<<25U)
#define RCC_CFGR_MCO1SEL                    (0x7U<<22U)
#define RCC_CFGR_MCO1SEL_0                  (0x1U<<22U)
#define RCC_CFGR_MCO1PRE                    (0xFU<<18U)
#define RCC_CFGR_MCO1PRE_0                  (0x1U<<18U)
#define RCC_CFGR_TIMPRE                     (0x1U<<15U)
#define RCC_CFGR_HRTIMSEL                   (0x1U<<14U)
#define RCC_CFGR_RTCPRE                     (0x3FU<<8U)
#define RCC_CFGR_RTCPRE_0                   (0x1U<<8U)
#define RCC_CFGR_STOPKERWUCK                (0x1U<<7U)
#define RCC_CFGR_STOPWUCK                   (0x1U<<6U)
#define RCC_CFGR_SWS                        (0x7U<<3U)
#define RCC_CFGR_SWS_0                      (0x1U<<3U)
#define RCC_CFGR_SW                         (0x7U<<0U)
#define RCC_CFGR_SW_0                       (0x1U<<0U)

