Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM7_rcc.h
// D1CFGR Configuration

#define RCC_D1CFGR_D1CPRE                   (0xFU<<8U)
#define RCC_D1CFGR_D1CPRE_0                 (0x1U<<8U)
#define RCC_D1CFGR_D1PPRE                   (0x7U<<4U)
#define RCC_D1CFGR_D1PPRE_0                 (0x1U<<4U)
#define RCC_D1CFGR_HPRE                     (0xFU<<0U)
#define RCC_D1CFGR_HPRE_0                   (0x1U<<0U)

// D2CFGR Configuration

#define RCC_D2CFGR_D2PPRE2                  (0x7U<<8U)
#define RCC_D2CFGR_D2PPRE2_0                (0x1U<<8U)
#define RCC_D2CFGR_D2PPRE1                  (0x7U<<4U)
#define RCC_D2CFGR_D2PPRE1_0                (0x1U<<4U)

// D3CFGR Configuration

#define RCC_D3CFGR_D3PPRE                   (0x7U<<4U)
#define RCC_D3CFGR_D3PPRE_0                 (0x1U<<4U)

// PLLCKSELR Configuration

#define RCC_PLLCKSELR_DIVM3                 (0x3FU<<20U)
#define RCC_PLLCKSELR_DIVM3_0               (0x1U<<20U)
#define RCC_PLLCKSELR_DIVM2                 (0x3FU<<12U)
#define RCC_PLLCKSELR_DIVM2_0               (0x1U<<12U)
#define RCC_PLLCKSELR_DIVM1                 (0x3FU<<4U)
#define RCC_PLLCKSELR_DIVM1_0               (0x1U<<4U)
#define RCC_PLLCKSELR_PLLSRC                (0x3U<<0U)
#define RCC_PLLCKSELR_PLLSRC_0              (0x1U<<0U)

// PLLCFGR Configuration

#define RCC_PLLCFGR_DIVR3EN                 (0x1U<<24U)
#define RCC_PLLCFGR_DIVQ3EN                 (0x1U<<23U)
#define RCC_PLLCFGR_DIVP3EN                 (0x1U<<22U)
#define RCC_PLLCFGR_DIVR2EN                 (0x1U<<21U)
#define RCC_PLLCFGR_DIVQ2EN                 (0x1U<<20U)
#define RCC_PLLCFGR_DIVP2EN                 (0x1U<<19U)
#define RCC_PLLCFGR_DIVR1EN                 (0x1U<<18U)
#define RCC_PLLCFGR_DIVQ1EN                 (0x1U<<17U)
#define RCC_PLLCFGR_DIVP1EN                 (0x1U<<16U)
#define RCC_PLLCFGR_PLL3RGE                 (0x3U<<10U)
#define RCC_PLLCFGR_PLL3RGE_0               (0x1U<<10U)
#define RCC_PLLCFGR_PLL3VCOSEL              (0x1U<<9U)
#define RCC_PLLCFGR_PLL3FRACEN              (0x1U<<8U)
#define RCC_PLLCFGR_PLL2RGE                 (0x3U<<6U)
#define RCC_PLLCFGR_PLL2RGE_0               (0x1U<<6U)
#define RCC_PLLCFGR_PLL2VCOSEL              (0x1U<<5U)
#define RCC_PLLCFGR_PLL2FRACEN              (0x1U<<4U)
#define RCC_PLLCFGR_PLL1RGE                 (0x3U<<2U)
#define RCC_PLLCFGR_PLL1RGE_0               (0x1U<<2U)
#define RCC_PLLCFGR_PLL1VCOSEL              (0x1U<<1U)
#define RCC_PLLCFGR_PLL1FRACEN              (0x1U<<0U)

// PLL1DIVR Configuration

#define RCC_PLL1DIVR_DIVR1                  (0x7FU<<24U)
#define RCC_PLL1DIVR_DIVR1_0                (0x1U<<24U)
#define RCC_PLL1DIVR_DIVQ1                  (0x7FU<<16U)
#define RCC_PLL1DIVR_DIVQ1_0                (0x1U<<16U)
#define RCC_PLL1DIVR_DIVP1                  (0x7FU<<9U)
#define RCC_PLL1DIVR_DIVP1_0                (0x1U<<9U)
#define RCC_PLL1DIVR_DIVN1                  (0x1FFU<<0U)
#define RCC_PLL1DIVR_DIVN1_0                (0x1U<<0U)

// PLL1FRACR Configuration

#define RCC_PLL1FRACR_FRACN1                (0x1FFFU<<3U)
#define RCC_PLL1FRACR_FRACN1_0              (0x1U<<3U)

// PLL2DIVR Configuration

#define RCC_PLL2DIVR_DIVR2                  (0x7FU<<24U)
#define RCC_PLL2DIVR_DIVR2_0                (0x1U<<24U)
#define RCC_PLL2DIVR_DIVQ2                  (0x7FU<<16U)
#define RCC_PLL2DIVR_DIVQ2_0                (0x1U<<16U)
#define RCC_PLL2DIVR_DIVP2                  (0x7FU<<9U)
#define RCC_PLL2DIVR_DIVP2_0                (0x1U<<9U)
#define RCC_PLL2DIVR_DIVN2                  (0x1FFU<<0U)
#define RCC_PLL2DIVR_DIVN2_0                (0x1U<<0U)

// PLL2FRACR Configuration

#define RCC_PLL2FRACR_FRACN2                (0x1FFFU<<3U)
#define RCC_PLL2FRACR_FRACN2_0              (0x1U<<3U)

// PLL3DIVR Configuration

#define RCC_PLL3DIVR_DIVR3                  (0x7FU<<24U)
#define RCC_PLL3DIVR_DIVR3_0                (0x1U<<24U)
#define RCC_PLL3DIVR_DIVQ3                  (0x7FU<<16U)
#define RCC_PLL3DIVR_DIVQ3_0                (0x1U<<16U)
#define RCC_PLL3DIVR_DIVP3                  (0x7FU<<9U)
#define RCC_PLL3DIVR_DIVP3_0                (0x1U<<9U)
#define RCC_PLL3DIVR_DIVN3                  (0x1FFU<<0U)
#define RCC_PLL3DIVR_DIVN3_0                (0x1U<<0U)

// PLL3FRACR Configuration

#define RCC_PLL3FRACR_FRACN3                (0x1FFFU<<3U)
#define RCC_PLL3FRACR_FRACN3_0              (0x1U<<3U)

// D1CCIPR Configuration

#define RCC_D1CCIPR_CKPERSRC                (0x3U<<28U)
#define RCC_D1CCIPR_CKPERSRC_0              (0x1U<<28U)
#define RCC_D1CCIPR_SDMMCSRC                (0x1U<<16U)
#define RCC_D1CCIPR_QSPISRC                 (0x3U<<4U)
#define RCC_D1CCIPR_QSPISRC_0               (0x1U<<4U)
#define RCC_D1CCIPR_FMCSRC                  (0x3U<<0U)
#define RCC_D1CCIPR_FMCSRC_0                (0x1U<<0U)

// D2CCIP1R Configuration

#define RCC_D2CCIP1R_SWPSRC                 (0x1U<<31U)
#define RCC_D2CCIP1R_FDCANSRC               (0x3U<<28U)
#define RCC_D2CCIP1R_FDCANSRC_0             (0x1U<<28U)
#define RCC_D2CCIP1R_DFSDM1SRC              (0x1U<<24U)
#define RCC_D2CCIP1R_SPDIFSRC               (0x3U<<20U)
#define RCC_D2CCIP1R_SPDIFSRC_0             (0x1U<<20U)
#define RCC_D2CCIP1R_SPI45SRC               (0x7U<<16U)
#define RCC_D2CCIP1R_SPI45SRC_0             (0x1U<<16U)
#define RCC_D2CCIP1R_SPI123SRC              (0x7U<<12U)
#define RCC_D2CCIP1R_SPI123SRC_0            (0x1U<<12U)
#define RCC_D2CCIP1R_SAI23SRC               (0x7U<<6U)
#define RCC_D2CCIP1R_SAI23SRC_0             (0x1U<<6U)
#define RCC_D2CCIP1R_SAI1SRC                (0x7U<<0U)
#define RCC_D2CCIP1R_SAI1SRC_0              (0x1U<<0U)

// D2CCIP2R Configuration

#define RCC_D2CCIP2R_LPTIM1SRC              (0x7U<<28U)
#define RCC_D2CCIP2R_LPTIM1SRC_0            (0x1U<<28U)
#define RCC_D2CCIP2R_CECSRC                 (0x3U<<22U)
#define RCC_D2CCIP2R_CECSRC_0               (0x1U<<22U)
#define RCC_D2CCIP2R_USBSRC                 (0x3U<<20U)
#define RCC_D2CCIP2R_USBSRC_0               (0x1U<<20U)
#define RCC_D2CCIP2R_I2C123SRC              (0x3U<<12U)
#define RCC_D2CCIP2R_I2C123SRC_0            (0x1U<<12U)
#define RCC_D2CCIP2R_RNGSRC                 (0x3U<<8U)
#define RCC_D2CCIP2R_RNGSRC_0               (0x1U<<8U)
#define RCC_D2CCIP2R_USART16SRC             (0x7U<<3U)
#define RCC_D2CCIP2R_USART16SRC_0           (0x1U<<3U)
#define RCC_D2CCIP2R_USART234578SRC         (0x7U<<0U)
#define RCC_D2CCIP2R_USART234578SRC_0       (0x1U<<0U)

// D3CCIPR Configuration

#define RCC_D3CCIPR_SPI6SRC                 (0x7U<<28U)
#define RCC_D3CCIPR_SPI6SRC_0               (0x1U<<28U)
#define RCC_D3CCIPR_SAI4BSRC                (0x7U<<24U)
#define RCC_D3CCIPR_SAI4BSRC_0              (0x1U<<24U)
#define RCC_D3CCIPR_SAI4ASRC                (0x7U<<21U)
#define RCC_D3CCIPR_SAI4ASRC_0              (0x1U<<21U)
#define RCC_D3CCIPR_ADCSRC                  (0x3U<<16U)
#define RCC_D3CCIPR_ADCSRC_0                (0x1U<<16U)
#define RCC_D3CCIPR_LPTIM345SRC             (0x7U<<13U)
#define RCC_D3CCIPR_LPTIM345SRC_0           (0x1U<<13U)
#define RCC_D3CCIPR_LPTIM2SRC               (0x7U<<10U)
#define RCC_D3CCIPR_LPTIM2SRC_0             (0x1U<<10U)
#define RCC_D3CCIPR_I2C4SRC                 (0x3U<<8U)
#define RCC_D3CCIPR_I2C4SRC_0               (0x1U<<8U)
#define RCC_D3CCIPR_LPUART1SRC              (0x7U<<0U)
#define RCC_D3CCIPR_LPUART1SRC_0            (0x1U<<0U)

// CIER Configuration

#define RCC_CIER_LSECSSIE                   (0x1U<<9U)
#define RCC_CIER_PLL3RDYIE                  (0x1U<<8U)
#define RCC_CIER_PLL2RDYIE                  (0x1U<<7U)
#define RCC_CIER_PLL1RDYIE                  (0x1U<<6U)
#define RCC_CIER_RC48RDYIE                  (0x1U<<5U)
#define RCC_CIER_CSIRDYIE                   (0x1U<<4U)
#define RCC_CIER_HSERDYIE                   (0x1U<<3U)
#define RCC_CIER_HSIRDYIE                   (0x1U<<2U)
#define RCC_CIER_LSERDYIE                   (0x1U<<1U)
#define RCC_CIER_LSIRDYIE                   (0x1U<<0U)

// CIFR Configuration

