Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM7_rcc.h
#define RCC_C1_AHB2ENR_SRAM3EN              (0x1U<<31U)
#define RCC_C1_AHB2ENR_SRAM2EN              (0x1U<<30U)
#define RCC_C1_AHB2ENR_SRAM1EN              (0x1U<<29U)
#define RCC_C1_AHB2ENR_SDMMC2EN             (0x1U<<9U)
#define RCC_C1_AHB2ENR_RNGEN                (0x1U<<6U)
#define RCC_C1_AHB2ENR_HASHEN               (0x1U<<5U)
#define RCC_C1_AHB2ENR_CRYPTEN              (0x1U<<4U)
#define RCC_C1_AHB2ENR_CAMITFEN             (0x1U<<0U)

// C1_AHB4ENR Configuration

#define RCC_C1_AHB4ENR_BKPRAMEN             (0x1U<<28U)
#define RCC_C1_AHB4ENR_HSEMEN               (0x1U<<25U)
#define RCC_C1_AHB4ENR_ADC3EN               (0x1U<<24U)
#define RCC_C1_AHB4ENR_BDMAEN               (0x1U<<21U)
#define RCC_C1_AHB4ENR_CRCEN                (0x1U<<19U)
#define RCC_C1_AHB4ENR_GPIOKEN              (0x1U<<10U)
#define RCC_C1_AHB4ENR_GPIOJEN              (0x1U<<9U)
#define RCC_C1_AHB4ENR_GPIOIEN              (0x1U<<8U)
#define RCC_C1_AHB4ENR_GPIOHEN              (0x1U<<7U)
#define RCC_C1_AHB4ENR_GPIOGEN              (0x1U<<6U)
#define RCC_C1_AHB4ENR_GPIOFEN              (0x1U<<5U)
#define RCC_C1_AHB4ENR_GPIOEEN              (0x1U<<4U)
#define RCC_C1_AHB4ENR_GPIODEN              (0x1U<<3U)
#define RCC_C1_AHB4ENR_GPIOCEN              (0x1U<<2U)
#define RCC_C1_AHB4ENR_GPIOBEN              (0x1U<<1U)
#define RCC_C1_AHB4ENR_GPIOAEN              (0x1U<<0U)

// C1_APB3ENR Configuration

#define RCC_C1_APB3ENR_WWDG1EN              (0x1U<<6U)
#define RCC_C1_APB3ENR_LTDCEN               (0x1U<<3U)

// C1_APB1LENR Configuration

#define RCC_C1_APB1LENR_USART8EN            (0x1U<<31U)
#define RCC_C1_APB1LENR_USART7EN            (0x1U<<30U)
#define RCC_C1_APB1LENR_DAC12EN             (0x1U<<29U)
#define RCC_C1_APB1LENR_HDMICECEN           (0x1U<<27U)
#define RCC_C1_APB1LENR_I2C3EN              (0x1U<<23U)
#define RCC_C1_APB1LENR_I2C2EN              (0x1U<<22U)
#define RCC_C1_APB1LENR_I2C1EN              (0x1U<<21U)
#define RCC_C1_APB1LENR_UART5EN             (0x1U<<20U)
#define RCC_C1_APB1LENR_UART4EN             (0x1U<<19U)
#define RCC_C1_APB1LENR_USART3EN            (0x1U<<18U)
#define RCC_C1_APB1LENR_USART2EN            (0x1U<<17U)
#define RCC_C1_APB1LENR_SPDIFRXEN           (0x1U<<16U)
#define RCC_C1_APB1LENR_SPI3EN              (0x1U<<15U)
#define RCC_C1_APB1LENR_SPI2EN              (0x1U<<14U)
#define RCC_C1_APB1LENR_LPTIM1EN            (0x1U<<9U)
#define RCC_C1_APB1LENR_TIM14EN             (0x1U<<8U)
#define RCC_C1_APB1LENR_TIM13EN             (0x1U<<7U)
#define RCC_C1_APB1LENR_TIM12EN             (0x1U<<6U)
#define RCC_C1_APB1LENR_TIM7EN              (0x1U<<5U)
#define RCC_C1_APB1LENR_TIM6EN              (0x1U<<4U)
#define RCC_C1_APB1LENR_TIM5EN              (0x1U<<3U)
#define RCC_C1_APB1LENR_TIM4EN              (0x1U<<2U)
#define RCC_C1_APB1LENR_TIM3EN              (0x1U<<1U)
#define RCC_C1_APB1LENR_TIM2EN              (0x1U<<0U)

// C1_APB1HENR Configuration

#define RCC_C1_APB1HENR_FDCANEN             (0x1U<<8U)
#define RCC_C1_APB1HENR_MDIOSEN             (0x1U<<5U)
#define RCC_C1_APB1HENR_OPAMPEN             (0x1U<<4U)
#define RCC_C1_APB1HENR_SWPEN               (0x1U<<2U)
#define RCC_C1_APB1HENR_CRSEN               (0x1U<<1U)

// C1_APB2ENR Configuration

#define RCC_C1_APB2ENR_HRTIMEN              (0x1U<<29U)
#define RCC_C1_APB2ENR_DFSDM1EN             (0x1U<<28U)
#define RCC_C1_APB2ENR_SAI3EN               (0x1U<<24U)
#define RCC_C1_APB2ENR_SAI2EN               (0x1U<<23U)
#define RCC_C1_APB2ENR_SAI1EN               (0x1U<<22U)
#define RCC_C1_APB2ENR_SPI5EN               (0x1U<<20U)
#define RCC_C1_APB2ENR_TIM17EN              (0x1U<<18U)
#define RCC_C1_APB2ENR_TIM15EN              (0x1U<<16U)
#define RCC_C1_APB2ENR_TIM16EN              (0x1U<<17U)
#define RCC_C1_APB2ENR_SPI4EN               (0x1U<<13U)
#define RCC_C1_APB2ENR_SPI1EN               (0x1U<<12U)
#define RCC_C1_APB2ENR_USART6EN             (0x1U<<5U)
#define RCC_C1_APB2ENR_USART1EN             (0x1U<<4U)
#define RCC_C1_APB2ENR_TIM8EN               (0x1U<<1U)
#define RCC_C1_APB2ENR_TIM1EN               (0x1U<<0U)

// C1_APB4ENR Configuration

#define RCC_C1_APB4ENR_SAI4EN               (0x1U<<21U)
#define RCC_C1_APB4ENR_RTCAPBEN             (0x1U<<16U)
#define RCC_C1_APB4ENR_VREFEN               (0x1U<<15U)
#define RCC_C1_APB4ENR_COMP12EN             (0x1U<<14U)
#define RCC_C1_APB4ENR_LPTIM5EN             (0x1U<<12U)
#define RCC_C1_APB4ENR_LPTIM4EN             (0x1U<<11U)
#define RCC_C1_APB4ENR_LPTIM3EN             (0x1U<<10U)
#define RCC_C1_APB4ENR_LPTIM2EN             (0x1U<<9U)
#define RCC_C1_APB4ENR_I2C4EN               (0x1U<<7U)
#define RCC_C1_APB4ENR_SPI6EN               (0x1U<<5U)
#define RCC_C1_APB4ENR_LPUART1EN            (0x1U<<3U)
#define RCC_C1_APB4ENR_SYSCFGEN             (0x1U<<1U)

// C1_AHB3LPENR Configuration

#define RCC_C1_AHB3LPENR_AXISRAMLPEN        (0x1U<<31U)
#define RCC_C1_AHB3LPENR_ITCMLPEN           (0x1U<<30U)
#define RCC_C1_AHB3LPENR_DTCM2LPEN          (0x1U<<29U)
#define RCC_C1_AHB3LPENR_D1DTCM1LPEN        (0x1U<<28U)
#define RCC_C1_AHB3LPENR_SDMMC1LPEN         (0x1U<<16U)
#define RCC_C1_AHB3LPENR_QSPILPEN           (0x1U<<14U)
#define RCC_C1_AHB3LPENR_FMCLPEN            (0x1U<<12U)
#define RCC_C1_AHB3LPENR_FLITFLPEN          (0x1U<<8U)
#define RCC_C1_AHB3LPENR_JPGDECLPEN         (0x1U<<5U)
#define RCC_C1_AHB3LPENR_DMA2DLPEN          (0x1U<<4U)
#define RCC_C1_AHB3LPENR_MDMALPEN           (0x1U<<0U)

// C1_AHB1LPENR Configuration

#define RCC_C1_AHB1LPENR_USB2ULPILPEN       (0x1U<<28U)
#define RCC_C1_AHB1LPENR_USB2OTGLPEN        (0x1U<<27U)
#define RCC_C1_AHB1LPENR_USB1ULPILPEN       (0x1U<<26U)
#define RCC_C1_AHB1LPENR_USB1OTGLPEN        (0x1U<<25U)
#define RCC_C1_AHB1LPENR_ETH1RXLPEN         (0x1U<<17U)
#define RCC_C1_AHB1LPENR_ETH1TXLPEN         (0x1U<<16U)
#define RCC_C1_AHB1LPENR_ETH1MACLPEN        (0x1U<<15U)
#define RCC_C1_AHB1LPENR_ADC12LPEN          (0x1U<<5U)
#define RCC_C1_AHB1LPENR_DMA2LPEN           (0x1U<<1U)
#define RCC_C1_AHB1LPENR_DMA1LPEN           (0x1U<<0U)

// C1_AHB2LPENR Configuration

#define RCC_C1_AHB2LPENR_SRAM3LPEN          (0x1U<<31U)
#define RCC_C1_AHB2LPENR_SRAM2LPEN          (0x1U<<30U)
#define RCC_C1_AHB2LPENR_SRAM1LPEN          (0x1U<<29U)
#define RCC_C1_AHB2LPENR_RNGLPEN            (0x1U<<6U)
#define RCC_C1_AHB2LPENR_SDMMC2LPEN         (0x1U<<9U)
#define RCC_C1_AHB2LPENR_HASHLPEN           (0x1U<<5U)
#define RCC_C1_AHB2LPENR_CRYPTLPEN          (0x1U<<4U)
#define RCC_C1_AHB2LPENR_CAMITFLPEN         (0x1U<<0U)

