Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM7_rcc.h
// C1_AHB4LPENR Configuration

#define RCC_C1_AHB4LPENR_SRAM4LPEN          (0x1U<<29U)
#define RCC_C1_AHB4LPENR_BKPRAMLPEN         (0x1U<<28U)
#define RCC_C1_AHB4LPENR_ADC3LPEN           (0x1U<<24U)
#define RCC_C1_AHB4LPENR_BDMALPEN           (0x1U<<21U)
#define RCC_C1_AHB4LPENR_CRCLPEN            (0x1U<<19U)
#define RCC_C1_AHB4LPENR_GPIOKLPEN          (0x1U<<10U)
#define RCC_C1_AHB4LPENR_GPIOJLPEN          (0x1U<<9U)
#define RCC_C1_AHB4LPENR_GPIOILPEN          (0x1U<<8U)
#define RCC_C1_AHB4LPENR_GPIOHLPEN          (0x1U<<7U)
#define RCC_C1_AHB4LPENR_GPIOGLPEN          (0x1U<<6U)
#define RCC_C1_AHB4LPENR_GPIOFLPEN          (0x1U<<5U)
#define RCC_C1_AHB4LPENR_GPIOELPEN          (0x1U<<4U)
#define RCC_C1_AHB4LPENR_GPIODLPEN          (0x1U<<3U)
#define RCC_C1_AHB4LPENR_GPIOCLPEN          (0x1U<<2U)
#define RCC_C1_AHB4LPENR_GPIOBLPEN          (0x1U<<1U)
#define RCC_C1_AHB4LPENR_GPIOALPEN          (0x1U<<0U)

// C1_APB3LPENR Configuration

#define RCC_C1_APB3LPENR_WWDG1LPEN          (0x1U<<6U)
#define RCC_C1_APB3LPENR_LTDCLPEN           (0x1U<<3U)

// C1_APB1LLPENR Configuration

#define RCC_C1_APB1LLPENR_USART8LPEN        (0x1U<<31U)
#define RCC_C1_APB1LLPENR_USART7LPEN        (0x1U<<30U)
#define RCC_C1_APB1LLPENR_DAC12LPEN         (0x1U<<29U)
#define RCC_C1_APB1LLPENR_HDMICECLPEN       (0x1U<<27U)
#define RCC_C1_APB1LLPENR_I2C3LPEN          (0x1U<<23U)
#define RCC_C1_APB1LLPENR_I2C2LPEN          (0x1U<<22U)
#define RCC_C1_APB1LLPENR_I2C1LPEN          (0x1U<<21U)
#define RCC_C1_APB1LLPENR_UART5LPEN         (0x1U<<20U)
#define RCC_C1_APB1LLPENR_UART4LPEN         (0x1U<<19U)
#define RCC_C1_APB1LLPENR_USART3LPEN        (0x1U<<18U)
#define RCC_C1_APB1LLPENR_USART2LPEN        (0x1U<<17U)
#define RCC_C1_APB1LLPENR_SPDIFRXLPEN       (0x1U<<16U)
#define RCC_C1_APB1LLPENR_SPI3LPEN          (0x1U<<15U)
#define RCC_C1_APB1LLPENR_SPI2LPEN          (0x1U<<14U)
#define RCC_C1_APB1LLPENR_LPTIM1LPEN        (0x1U<<9U)
#define RCC_C1_APB1LLPENR_TIM14LPEN         (0x1U<<8U)
#define RCC_C1_APB1LLPENR_TIM13LPEN         (0x1U<<7U)
#define RCC_C1_APB1LLPENR_TIM12LPEN         (0x1U<<6U)
#define RCC_C1_APB1LLPENR_TIM7LPEN          (0x1U<<5U)
#define RCC_C1_APB1LLPENR_TIM6LPEN          (0x1U<<4U)
#define RCC_C1_APB1LLPENR_TIM5LPEN          (0x1U<<3U)
#define RCC_C1_APB1LLPENR_TIM4LPEN          (0x1U<<2U)
#define RCC_C1_APB1LLPENR_TIM3LPEN          (0x1U<<1U)
#define RCC_C1_APB1LLPENR_TIM2LPEN          (0x1U<<0U)

// C1_APB1HLPENR Configuration

#define RCC_C1_APB1HLPENR_FDCANLPEN         (0x1U<<8U)
#define RCC_C1_APB1HLPENR_MDIOSLPEN         (0x1U<<5U)
#define RCC_C1_APB1HLPENR_OPAMPLPEN         (0x1U<<4U)
#define RCC_C1_APB1HLPENR_SWPLPEN           (0x1U<<2U)
#define RCC_C1_APB1HLPENR_CRSLPEN           (0x1U<<1U)

// C1_APB2LPENR Configuration

#define RCC_C1_APB2LPENR_HRTIMLPEN          (0x1U<<29U)
#define RCC_C1_APB2LPENR_DFSDM1LPEN         (0x1U<<28U)
#define RCC_C1_APB2LPENR_SAI3LPEN           (0x1U<<24U)
#define RCC_C1_APB2LPENR_SAI2LPEN           (0x1U<<23U)
#define RCC_C1_APB2LPENR_SAI1LPEN           (0x1U<<22U)
#define RCC_C1_APB2LPENR_SPI5LPEN           (0x1U<<20U)
#define RCC_C1_APB2LPENR_TIM17LPEN          (0x1U<<18U)
#define RCC_C1_APB2LPENR_TIM16LPEN          (0x1U<<17U)
#define RCC_C1_APB2LPENR_TIM15LPEN          (0x1U<<16U)
#define RCC_C1_APB2LPENR_SPI4LPEN           (0x1U<<13U)
#define RCC_C1_APB2LPENR_SPI1LPEN           (0x1U<<12U)
#define RCC_C1_APB2LPENR_USART6LPEN         (0x1U<<5U)
#define RCC_C1_APB2LPENR_USART1LPEN         (0x1U<<4U)
#define RCC_C1_APB2LPENR_TIM8LPEN           (0x1U<<1U)
#define RCC_C1_APB2LPENR_TIM1LPEN           (0x1U<<0U)

// C1_APB4LPENR Configuration

#define RCC_C1_APB4LPENR_SAI4LPEN           (0x1U<<21U)
#define RCC_C1_APB4LPENR_RTCAPBLPEN         (0x1U<<16U)
#define RCC_C1_APB4LPENR_VREFLPEN           (0x1U<<15U)
#define RCC_C1_APB4LPENR_COMP12LPEN         (0x1U<<14U)
#define RCC_C1_APB4LPENR_LPTIM5LPEN         (0x1U<<12U)
#define RCC_C1_APB4LPENR_LPTIM4LPEN         (0x1U<<11U)
#define RCC_C1_APB4LPENR_LPTIM3LPEN         (0x1U<<10U)
#define RCC_C1_APB4LPENR_LPTIM2LPEN         (0x1U<<9U)
#define RCC_C1_APB4LPENR_I2C4LPEN           (0x1U<<7U)
#define RCC_C1_APB4LPENR_SPI6LPEN           (0x1U<<5U)
#define RCC_C1_APB4LPENR_LPUART1LPEN        (0x1U<<3U)
#define RCC_C1_APB4LPENR_SYSCFGLPEN         (0x1U<<1U)
